"use client";
import React, { useState } from "react";
import CheckboxComponent from "@/components/checkbox";
import Button from "@/components/button";


const TermsOfService: React.FC = () => {
const [isChecked, setIsChecked] = useState(false); // Checkbox-ийн төлөв хадгалах

  const handleCheckboxChange = (checked: boolean, value: string) => {
    console.log(`Checkbox clicked: ${value}, checked: ${checked}`);
    setIsChecked(checked);
  };

  return (
    <div className="flex flex-col gap-6">
        <div className="border border-gray-300 rounded-lg p-4 bg-white">
            <h1 className="font-bold mb-5"> Үйлчилгээний нөхцөл: </h1>
            <pre className="text-base whitespace-pre-line text-sm">
                НЭГ. НЭР ТОМЪЁО, ТОДОРХОЙЛОЛТ
                ХОЁР. ЕРӨНХИЙ ЗҮЙЛ
                ГУРАВ. ҮЙЛЧИЛГЭЭНИЙ НӨХЦӨЛ
                - 3.1 Харилцагчийн бүртгэл

                - 3.2 Төсөл ба түүнд тавигдах шаардлага

                - 3.3 Үйлчилгээний шимтгэл болон хураамж

                - 3.4 Буцаан олголт
                ДӨРӨВ. ХАРИЛЦАГЧИЙН ЭРХ, ҮҮРЭГ

                - 4.1 Харилцагчийн эрх

                - 4.2 Харилцагчийн үүрэг

                ТАВ. “ФАНДИА” ХХК-ийн ЭРХ, ҮҮРЭГ

                - 5.1 Фандиа ХХК-ийн эрх

                - 5.2 Фандиа ХХК-ийн үүрэг

                ЗУРГАА. ХАРИУЦЛАГА

                ДОЛОО. ОЮУНЫ ӨМЧ

                НАЙМ. БУСАД


                НЭГ. НЭР ТОМЬЁОНЫ ТОДОРХОЙЛОЛТ

                Энэхүү үйлчилгээний нөхцөлд дараах нэр, томьёог дор дурдсан утгаар ойлгоно. Үүнд:

                1.1 Төсөл гэж платформыг ашиглаж олон нийтээс цахим хэлбэрээр санхүүжилт болон хөрөнгө оруулалт татах зорилготой бизнесийн болон нийгмийн шинж чанартай төслийг;

                1.2 Хандивын төсөл гэж санхүүжүүлэгч нь төсөл хэрэгжүүлэгчид хандивласан хөрөнгөө буцаан авах нөхцөлгүйгээр санхүүжүүлэх хэлбэрийг;

                1.3 Урамшууллын төсөл гэж Төсөл хэрэгжүүлэгч нь санхүүжилт өгсөн иргэн, хуулийн этгээдийг урамшуулж мөнгөн бус хэлбэрээр бүтээгдэхүүн, үйлчилгээгээ санал болгохыг;

                1.4 Хувьцааны төсөл гэж “Хязгаарлагдмал Хариуцлагатай Компани” нь өөрийн компанийн хувьцаагаа олон нийтэд санал болгон хөрөнгө оруулалт татах замаар хамтын санхүүжилтийг бүрдүүлж, хэрэгжүүлэх төслийг;

                1.5 Төсөл хэрэгжүүлэгч гэж өөрийн төсөлд олон нийтээс санхүүжилт эсхүл хөрөнгө оруулалт авах зорилгоор платформоор эсвэл биечлэн платформийн үйлчилгээ үзүүлэгч “Фандиа” ХХК-д хүсэлт гаргасан иргэн, хуулийн этгээдийг;

                1.6 Төсөл санхүүжүүлэгч гэж платформд байршуулсан төслийг санхүүжүүлэх, түүнд хөрөнгө оруулах зорилгоор мөнгөн хөрөнгөө шилжүүлж буй иргэн, хуулийн этгээдийг;

                1.7 Төслийн нийт санхүүжилт гэж төсөл хэрэгжүүлэгчийн зүгээс төслийг хэрэгжүүлэхэд шаардагдах нийт үнийн дүн буюу төсөл хэрэгжүүлэгчээс fundea.mn платформд нийтэлсэн дүн;

                1.8 Платформ гэж санхүүжилт эсхүл хөрөнгө оруулалт шаардлагатай төслийг байршуулах болон санхүүжилт, хөрөнгө оруулалтыг олон нийтээс татан цугларуулахтай холбоотойгоор вэбсайтын үйлчилгээ үзүүлэх www.fundea.mn вэбсайтыг;

                1.9 Харилцагч гэж “Фандиа” ХХК-иас үзүүлж буй үйлчилгээг авах зорилгоор платформд бүртгүүлж, бүртгэлээ баталгаажуулсан иргэн, хуулийн этгээд буюу төсөл хэрэгжүүлэгч, төсөл санхүүжүүлэгчийг;

                1.10 Үйлчилгээний хураамж гэж Төсөл хэрэгжүүлэгч нь Фандиа платформ дээр төслөө байршуулахад төлж буй үнийн дүнг;

                1.11 Үйлчилгээний шимтгэл гэж Төсөл хэрэгжүүлэгчийн платформ дээр нийтэлсэн төслийн нийт санхүүжилт болон хөрөнгө оруулалт амжилттай цугларсан тохиолдолд “Фандиа” ХХК-д төлж буй төлбөрийг;



                ХОЁР. ЕРӨНХИЙ ЗҮЙЛ

                2.1 “Фандиа” платформ (www.fundea.mn вэбсайт) нь нэг талаас төсөл хэрэгжүүлэгч, нөгөө талаас төсөл санхүүжүүлэгч нарыг холбох үйлчилгээ үзүүлэх үүрэг бүхий сайт юм.

                2.2 “Фандиа” платформ (www.fundea.mn вэбсайт) нь “Фандиа” ХХК-ийн өмч бөгөөд харилцагч нь уг платформд өөрийн хэрэгжүүлэх төсөлд олон нийтээс санхүүжилт босгох, хөрөнгө оруулалт татах зорилгоор төслийн зорилго, төслийн хүрээнд хийгдэх үйл ажллагааны танилцуулга бүхий мэдээллийг Фандиа платформд нийтлэх, нөгөө талаас төсөл санхүүжүүлэгч платформд нийтлэгдсэн төслийн мэдээлэлтэй танилцаж тухайн төсөлд санхүүжилт олгох, хөрөнгө оруулах харилцааг энэхүү нөхцөлөөр зохицуулна.

                2.3 Энэхүү нөхцөлийг Монгол Улсын холбогдох хууль тогтоомж, “Фандиа” ХХК-ийн бодлого журам, үйлчилгээний ерөнхий нөхцөл болон шимтгэл, хураамжийн ерөнхий нөхцөлд үндэслэн боловсруулсан болно.

                2.4 Фандиа платформд нийтлэгдэж буй санхүүжилт босгох зорилго бүхий төслүүд нь урамшуулал, хандив болон хувьцаанд суурилсан байна.

                2.5 Урамшуулалд суурилсан төслийн хувьд төсөл санхүүжүүлэгч өөрийн сонирхож буй төсөлд санхүүжилт олгох бөгөөд төсөл хэрэгжүүлэгч нь нийт бүрдсэн санхүүжилтийг тухайн төсөлдөө зарцуулж, төсөл санхүүжүүлэгчид мөнгөн бус урамшуулал олгоно.

                2.5 Хандивт суурилсан төслийн хувьд төсөл санхүүжүүлэгч өөрийн сонирхож буй төсөлд санхүүжилт олгох буюу хандив өгөх бөгөөд төсөл хэрэгжүүлэгч нь нийт бүрдсэн санхүүжилтийг хандивын төсөлдөө зарцуулна. Хандивийн төсөлд санхүүжилт олгосон төсөл санхүүжүүлэгчид ямар нэгэн хэлбэрээр мөнгө, урамшуулал, буцаан олголт олгохгүй.

                2.6 Хувьцаанд суурилсан төслийн хувьд төсөл санхүүжүүлэгч нь Хязгаарлагдмал хариуцлагатай компанийн төсөлтэй танилцаж, түүнд хөрөнгө оруулах бөгөөд төслийн нийт санхүүжилт зорилтот дүндээ хүрч, санхүүжилт амжилттай бүрдсэн тохиолдолд төсөл санхүүжүүлэгч нь тухайн компанийн хувьцаа эзэмшигчээр бүртгүүлнэ.

                2.7 Харилцагч нь компанийн төсөлд хөрөнгө оруулалт хийх нь ямагт эрсдэлтэй үйлдэл байдгийг онцгойлон анхаарч, төслийн танилцуулга, үйл ажиллагааг сайтар судалсны үндсэн дээр шийдвэр гаргахыг “Фандиа” ХХК-ийн зүгээс зөвлөж байна. Аливаа төслийн хэрэгжилт, үр дүн, урамшуулал зэрэгт “Фандиа” ХХК нь баталгаа гаргахгүй, зөвхөн “Фандиа” платформ (www.fundea.mn вэбсайт)-д төслийн танилцуулга бүхий мэдээллийг нийтлэх үйл ажиллагаа явуулж байгаа болно. Төсөлд санхүүжилт олгосонтой холбоотой үр дагавар, эрх, үүрэг, хариуцлагыг тухайн этгээд өөрөө бие даан хариуцна.

                2.8 “Фандиа” ХХК нь санхүүжилт хүсэгчийн төсөл, санхүүжилттэй холбоотой аливаа мэдээлэл, баримт бичгийн үнэн зөв, баталгаатай, бүрэн гүйцэд байдалд баталгаа өгөхгүй бөгөөд баримт бичиг нь алдаатай, буруу, хуурамч, дутуу зэргээс үүдэн гарах аливаа хэлбэрийн хариуцлагыг “Фандиа” ХХК хүлээхгүй болно.

                2.9 Харилцагч дараах зөвшөөрлийг “Фандиа” ХХК-д олгосон бөгөөд Фандиа платформ дахин аливаа хэлбэрээр харилцагчаас бичгээр зөвшөөрөл авах шаардлагагүй болно. Үүнд:

                2.9.1 Харилцагч нь “Фандиа” платформд байршуулсан Үйлчилгээний ерөнхий нөхцөл болон шимтгэл, хураамжийн нөхцөлтэй танилцсан бөгөөд энэ төрлийн үйлчилгээг уг нөхцөлөөр авах, үйлчилгээний шимтгэл, хураамж зэрэг холбогдох төлбөрийг үл маргах журмаар төлөхийг үүгээр зөвшөөрч байна.

                2.9.2 Төсөл хэрэгжүүлэгч болон санхүүжүүлэгч нарыг холбох үйлчилгээг үзүүлэхтэй холбоотойгоор харилцагчийн хувийн мэдээллийг хүлээн авах, хадгалах, уг үйлчилгээний нөхцөлд заасан зорилгоор ашиглах, түүнд боловсруулалт хийх зөвшөөрлийг Фандиа-д олгож байна.

                2.9.3 Энэхүү нөхцөлийг зөвшөөрснөөс хойш Фандиа платформын бүтээгдэхүүн, үйлчилгээний ерөнхий нөхцөлд өөрчлөлт орсон тохиолдолд энэхүү нөхцөлд өөрөөр зааснаас бусад тохиолдолд www.fundea.mn цахим хуудаст байршуулсан Фандиа платформд тухайн үед мөрдөгдөж буй бүтээгдэхүүн, үйлчилгээний ерөнхий нөхцөлийг дагаж мөрдөхийг зөвшөөрч байна.
            </pre>
        </div>
        <CheckboxComponent
            label="Би “Үйлчилгээний нөхцөл”-ийг хүлээн зөвшөөрч байна."
            value="terms"
            checked={isChecked}
            className="text-gray-800 transition-colors duration-200 hover:text-primary-normal"
            onChange={handleCheckboxChange}
        />
        <Button
              variant="gradient"
              placeholder="Үргэлжлүүлэх"
              textVariant="gradient"
              className="w-44 h-8 mx-auto" />
    </div>
    
  );
};

export default TermsOfService;
